thread_classes = [
    {
        'title': "конфиденциальности",
        'ltr': 'c',
        'items': [
            "ПЭМИ",
            "наводки на соседние линии",
            "наводки на цепи заземления",
            "наводки на цепи питания"
        ]
    },
    {
        'title': "целостности",
        'ltr': 'i',
        'items': [
            "ошибки персонала",
            "сбой оборудования",
            "отказ ПО",
        ]
    },
    {
        'title': "доступности",
        'ltr': 'a',
        'items': [
            "ошибки персонала",
            "сбой оборудования",
            "отказ ПО",
        ]
    }
]

threads = [
    # Privacy
    [
        [18, 37, 14, 8],    # Server
        [38, 27, 4, 6],     # PC-1
        [32, 17, 5, 7],     # PC-2
        [13, 32, 5, 5],     # PC-3
    ],
    # Integrity
    [
        [5, 1, 3],          # Server
        [15, 9, 3],         # PC-1
        [11, 7, 4],         # PC-2
        [10, 8, 2],         # PC-3
    ],
    # Availability
    [
        [15, 10, 3],        # Server
        [12, 6, 3],         # PC-1
        [11, 5, 3],         # PC-2
        [9, 5, 2],          # PC-3
    ]
]

d = [73, 32, 37, 29]

